#!/usr/bin/env bash
set -euo pipefail

#################################
# HELPERS
#################################
log() { echo -e "\033[1;32m[INFO]\033[0m $1"; }
warn() { echo -e "\033[1;33m[WARN]\033[0m $1"; }
die() { echo -e "\033[1;31m[ERROR]\033[0m $1"; exit 1; }

#################################
# ROOT PRIVILEGES CHECKED
#################################
[[ $EUID -eq 0 ]] || die "Запускать нужно от root"


#################################
# ASCII- banner
#################################
cat << EOF
╔══════════════════════════════════════════════════════════╗
║           @@@  @@@  @@@@@@@@  @@@  @@@  @@@              ║
║           @@@@ @@@  @@@@@@@@  @@@  @@@  @@@              ║
║           @@!@!@@@  @@!       @@!  @@!  @@!              ║ 
║           !@!!@!@!  !@!       !@!  !@!  !@!              ║  
║           @!@ !!@!  @!!!:!    @!!  !!@  @!@              ║
║           !@!  !!!  !!!!!:    !@!  !!!  !@!              ║
║           !!:  !!!  !!:       !!:  !!:  !!:              ║
║           :!:  !:!  :!:       :!:  :!:  :!:              ║
║            ::   ::   :: ::::   :::: :: :::               ║
║           ::    :   : :: ::     :: :  : :                ║
║                                                          ║                                               
║            @@@@@@  @@@@@@@   @@@@@@   @@@@@@@   @@@@@@@  ║
║           @@@@@@@  @@@@@@@  @@@@@@@@  @@@@@@@@  @@@@@@@  ║
║           !@@        @@!    @@!  @@@  @@!  @@@    @@!    ║
║           !@!        !@!    !@!  @!@  !@!  @!@    !@!    ║
║           !!@@!!     @!!    @!@!@!@!  @!@!!@!     @!!    ║
║            !!@!!!    !!!    !!!@!!!!  !!@!@!      !!!    ║
║                !:!   !!:    !!:  !!!  !!: :!!     !!:    ║
║               !:!    :!:    :!:  !:!  :!:  !:!    :!:    ║
║           :::: ::     ::    ::   :::  ::   :::     ::    ║
║           :: : :      :      :   : :   :   : :     :     ║
║                                                          ║
║  Script: installing basic tools                          ║
║  Version: 1.1.2                                          ║
║  Author:  Stg. Katsu                                     ║
║  Started: $(date +"%H:%M:%S on %Y-%m-%d")                ║
╚══════════════════════════════════════════════════════════╝
EOF

#################################
# Base net settings
#################################
log "Оптимизация сетевого стека ядра"

CONF_FILE="/etc/sysctl.d/99-tunnel-optimization.conf"
cat > $CONF_FILE << EOF
# Оптимизация TCP для каскада туннелей (SSH, VPN)
# BBR + fq для максимальной производительности

# Планировщик очередей и алгоритм перегрузки
net.core.default_qdisc = fq
net.ipv4.tcp_congestion_control = bbr

# Максимальные размеры буферов (128 MB для 1 Gbit/s + запас)
net.core.rmem_max = 134217728
net.core.wmem_max = 134217728

# TCP буферы: формат "min default max"
net.ipv4.tcp_rmem = 4096 87380 134217728
net.ipv4.tcp_wmem = 4096 65536 134217728

# Доп. опции для улучшения работы с туннелями
net.ipv4.tcp_slow_start_after_idle = 0
net.ipv4.tcp_notsent_lowat = 16384
EOF

log "Применяем настройки (без перезагрузки)"
sysctl --system


#################################
# Run base settings
#################################
log "Обновление пакетов"
apt update && apt upgrade -y

log "Установка частоиспольуемых инструментов"
apt install wget curl net-tools git whois nano btop bind9-utils fish -y

log "Установка окружения FISH"
chsh -s /usr/bin/fish

log "Создание нового пользователя с правами sudo"
read -r -p 'Введите имя нового пользователя > ' USERNAME
adduser --shell /usr/bin/fish $USERNAME
usermod -aG sudo $USERNAME


warn "Перезагружаем сервер"
reboot